# Lab 6 Tasks - Solution

In this notebook we will work with a dataset containing records of car sales from dealerships in different parts of Ireland during a one-year period. Each row in the data represents the sale of a single car, described by the following features:

- *date*: the date when the car sale occurred
- *make*: the make or manufacturer of the car
- *model*: the specific model name of the car
- *year*: indicates the age of the car
- *transmission*: indicates if the car is manual, automatic, or semi-automatic
- *fuel_type*: specifies the type type of fuel used by the car
- *mileage*: the distance (in kilometres) that the car has previously been driven
- *region*: the province in Ireland where the car sale took place
- *sale_amount*: the amount (in euros) for which the car was sold

## Task 1 - Data Loading

Load the CSV file "car-sales.csv" into a Pandas DataFrame. Check the number of rows and the column names in the DataFrame.

In [1]:
import pandas as pd;

In [47]:
df = pd.read_csv("car-sales.csv",index_col="date")
df.head(20)
df.shape

(3805, 8)

## Task 2 - Handling Missing Values

Check the extent to which there are features with missing values present in the features in the dataset.

In [13]:
df.isnull().sum()

make            12
model            0
year             0
transmission    52
fuel_type       40
mileage          0
region           0
sale_amount      0
dtype: int64

Apply appropriate data preprocessing to address any issues with missing values.

In [21]:
max_make = df["make"].value_counts().idxmax()
max_transmission = df["transmission"].value_counts().idxmax()
max_fuel = df["fuel_type"].value_counts().idxmax()
df["make"] = df["make"].fillna(max_make)
df["transmission"] = df["transmission"].fillna(max_transmission)
df["fuel_type"] = df["fuel_type"].fillna(max_fuel)

In [49]:
df.head()

,make,model,year,transmission,fuel_type,mileage,region,sale_amount
date,,,,,,,,
2023-03-01,Audi,Q3,2021,Manual,Electric,4284,Leinster,43200
2022-08-08,Audi,A1,2017,Manual,Diesel,57397,Leinster,11400
2023-01-11,Audi,A1,2019,Manual,Petrol,14706,Connacht,18600
2023-04-21,Audi,Q3,2019,Semi-Auto,P,19400,Connacht,30800
2022-11-03,Audi,Q2,2021,Manual,Electric,6380,Leinster,25700

## Task 3 - Handling Irregulary Cardinality

Check the extent to which there are categorical features with irregular cardinality present in the features in the dataset.

Apply appropriate data preprocessing to address any issues with irregular cardinality.

## Task 4 - Data Aggregation

Use data aggregation to analysise how the *total sale amount* for cars sold in the full dataset relates to the *region* in which the sale took place. Sort the regions by highest to lowest total value.

In [77]:
groups1 = df.groupby("region")
groups1.sum(numeric_only=True)
groups1['sale_amount'].sum(numeric_only=True).sort_values(ascending=False)

region
Leinster    35143900
Munster     29167500
Connacht    26616500
Ulster      13159900
Name: sale_amount, dtype: int64

Next, use data aggregation to analysise how the *total sale amount* for cars sold in the full dataset relates to car *model*. Sort the models by highest to lowest total value.

In [83]:
groups2 = df.groupby("model")
groups2['sale_amount'].sum(numeric_only=True).sort_values(ascending=False)

model
Q3    17631000
A3    17599000
A4    14820800
Q5    14342700
A5    10851100
Q2     9970200
A1     9935500
A6     8937500
Name: sale_amount, dtype: int64

## Task 5 - Cross Tabulation

Use cross tabulation to examine the relationship between the *model* and *region* categorical variables.

In [87]:
pd.crosstab(df["region"], df["model"])

model      A1   A3   A4   A5   A6   Q2   Q3   Q5
region
Connacht  141  196  142   86   74   84  151   99
Leinster  172  260  191  114  112  113  195  126
Munster   146  230  165  101   70   90  171   92
Ulster     71   95   61   50   40   51   79   37

Next, use cross tabulation to examine the relationship between the *transmission* and *fuel type* categorical variables.

In this case, normalise the values in the cross-tabulation by row.

In [93]:
df2 = pd.crosstab(df["transmission"], df["fuel_type"])
df2

fuel_type      D  Diesel   E  Electric   P  Petrol
transmission
Auto           4      40   2        38   7      38
Automatic     34     226  15       175  30     202
Manual        61     628  21       158  76     711
Semi-Auto     40     352  28       254  62     511

In [97]:
df2 = df2.div(df2.sum(axis=1), axis=0)
df2

fuel_type            D    Diesel         E  Electric         P    Petrol
transmission
Auto          0.031008  0.310078  0.015504  0.294574  0.054264  0.294574
Automatic     0.049853  0.331378  0.021994  0.256598  0.043988  0.296188
Manual        0.036858  0.379456  0.012689  0.095468  0.045921  0.429607
Semi-Auto     0.032077  0.282277  0.022454  0.203689  0.049719  0.409783